perf/bbox-9091.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"


  pool: 200 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 20
    - name: Plain
      duration: 120
      arrivalRate: 20

scenarios:
  - name: Bbox9091
    flow:
      - get:
          url: '/bbox-2'